In [50]:
import pandas as pd
import numpy as np

In [51]:
schoolfilepath = "schools_complete.csv"
studentfilepath = "students_complete.csv"

In [96]:
schools = pd.read_csv(schoolfilepath, encoding="utf-8")
schools.head()

    School ID            school_name      type  size   budget
0           0      Huang High School  District  2917  1910635
1           1   Figueroa High School  District  2949  1884411
2           2    Shelton High School   Charter  1761  1056600
3           3  Hernandez High School  District  4635  3022020
4           4    Griffin High School   Charter  1468   917500
5           5     Wilson High School   Charter  2283  1319574
6           6    Cabrera High School   Charter  1858  1081356
7           7     Bailey High School  District  4976  3124928
8           8     Holden High School   Charter   427   248087
9           9       Pena High School   Charter   962   585858
10         10     Wright High School   Charter  1800  1049400
11         11  Rodriguez High School  District  3999  2547363
12         12    Johnson High School  District  4761  3094650
13         13       Ford High School  District  2739  1763916
14         14     Thomas High School   Charter  1635  1043130

In [53]:
students = pd.read_csv(studentfilepath, encoding="utf-8")
students.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58
4,4,Bonnie Ray,F,9th,Huang High School,97,84

In [54]:
schools.count()

School ID      15
school_name    15
type           15
size           15
budget         15
dtype: int64

In [55]:
students.count()

Student ID       39170
student_name     39170
gender           39170
grade            39170
school_name      39170
reading_score    39170
math_score       39170
dtype: int64

In [56]:
unq_schools = schools["school_name"].unique().tolist()
unq_schools

['Huang High School',
 'Figueroa High School',
 'Shelton High School',
 'Hernandez High School',
 'Griffin High School',
 'Wilson High School',
 'Cabrera High School',
 'Bailey High School',
 'Holden High School',
 'Pena High School',
 'Wright High School',
 'Rodriguez High School',
 'Johnson High School',
 'Ford High School',
 'Thomas High School']

In [57]:
tot_schools = len(unq_schools)
tot_schools

15

In [58]:
tot_students = len(students["student_name"])
tot_students

39170

In [59]:
tot_budget = schools["budget"].sum()
tot_budget

24649428

In [60]:
avg_math_score = round(students["math_score"].mean(),2)
avg_math_score

78.99

In [61]:
avg_read_score = round(students["reading_score"].mean(),2)
avg_read_score

81.88

In [62]:
passing_math = (len(students[students["math_score"] > 65]))
passing_math

32555

In [63]:
passing_reading = (len(students[students["reading_score"] > 65]))
passing_reading

36923

In [64]:
pct_passing_math = round((passing_math/tot_students)*100,2)
pct_passing_math

83.11

In [65]:
pct_passing_reading = round((passing_reading/tot_students)*100,2)
pct_passing_reading

94.26

In [66]:
pass_rate = round((pct_passing_math + pct_passing_reading)/2,2)
pass_rate

88.69

In [67]:
district_summary = pd.DataFrame({"Total Schools":[tot_schools],
                                 "Total Students":[tot_students],
                                 "Total Budget":[tot_budget],
                                 "Average Math Score":[avg_math_score],
                                 "Average Reading Score":[avg_read_score],
                                 "% Passing Math":[pct_passing_math],
                                 "% Passing Reading":[pct_passing_reading],
                                 "Overall Passing Rate":[pass_rate]})

district_summary["Total Students"]=district_summary["Total Students"].map("{:,}".format)
district_summary["Total Budget"]=district_summary["Total Budget"].map("${:,}".format)
district_summary["Average Math Score"]=district_summary["Average Math Score"].map("{:}%".format)
district_summary["Average Reading Score"]=district_summary["Average Reading Score"].map("{:}%".format)
district_summary["% Passing Math"]=district_summary["% Passing Math"].map("{:}%".format)
district_summary["% Passing Reading"]=district_summary["% Passing Reading"].map("{:}%".format)
district_summary["Overall Passing Rate"]=district_summary["Overall Passing Rate"].map("{:}%".format)

# District Summary

In [68]:
district_summary

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,Overall Passing Rate
0,15,"39,170","$24,649,428",78.99%,81.88%,83.11%,94.26%,88.69%

In [69]:
all_school_data = pd.merge(students,schools,on="school_name")
all_school_data.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635

In [70]:
total_students_per_school = all_school_data[["school_name","student_name"]]
total_students_per_school = total_students_per_school.groupby(["school_name"])
total_students_per_school = total_students_per_school.count()
total_students_per_school = total_students_per_school.rename(columns={"student_name":"student_count"})
total_students_per_school

                       student_count
school_name
Bailey High School              4976
Cabrera High School             1858
Figueroa High School            2949
Ford High School                2739
Griffin High School             1468
Hernandez High School           4635
Holden High School               427
Huang High School               2917
Johnson High School             4761
Pena High School                 962
Rodriguez High School           3999
Shelton High School             1761
Thomas High School              1635
Wilson High School              2283
Wright High School              1800

In [71]:
school_budgt = schools[["school_name","budget"]]
school_budgt

              school_name   budget
0       Huang High School  1910635
1    Figueroa High School  1884411
2     Shelton High School  1056600
3   Hernandez High School  3022020
4     Griffin High School   917500
5      Wilson High School  1319574
6     Cabrera High School  1081356
7      Bailey High School  3124928
8      Holden High School   248087
9        Pena High School   585858
10     Wright High School  1049400
11  Rodriguez High School  2547363
12    Johnson High School  3094650
13       Ford High School  1763916
14     Thomas High School  1043130

In [72]:
school_budgt = pd.merge(total_students_per_school,school_budgt,on="school_name")
school_budgt["budgt_per_student"] = school_budgt["budget"]/school_budgt["student_count"]
school_budgt

              school_name  student_count   budget  budgt_per_student
0      Bailey High School           4976  3124928              628.0
1     Cabrera High School           1858  1081356              582.0
2    Figueroa High School           2949  1884411              639.0
3        Ford High School           2739  1763916              644.0
4     Griffin High School           1468   917500              625.0
5   Hernandez High School           4635  3022020              652.0
6      Holden High School            427   248087              581.0
7       Huang High School           2917  1910635              655.0
8     Johnson High School           4761  3094650              650.0
9        Pena High School            962   585858              609.0
10  Rodriguez High School           3999  2547363              637.0
11    Shelton High School           1761  1056600              600.0
12     Thomas High School           1635  1043130              638.0
13     Wilson High School           2283  1319574              578.0
14     Wright High School           1800  1049400              583.0

In [73]:
school_math_avg = all_school_data[["school_name","type","math_score"]]
school_math_avg = school_math_avg.groupby(["school_name"])
school_math_avg = school_math_avg.mean()
school_math_avg = school_math_avg.rename(columns={"math_score":"math_avg"})
school_math_avg

                        math_avg
school_name
Bailey High School     77.048432
Cabrera High School    83.061895
Figueroa High School   76.711767
Ford High School       77.102592
Griffin High School    83.351499
Hernandez High School  77.289752
Holden High School     83.803279
Huang High School      76.629414
Johnson High School    77.072464
Pena High School       83.839917
Rodriguez High School  76.842711
Shelton High School    83.359455
Thomas High School     83.418349
Wilson High School     83.274201
Wright High School     83.682222

In [74]:
school_reading_avg = all_school_data[["school_name","reading_score"]]
school_reading_avg = school_reading_avg.groupby(["school_name"])
school_reading_avg = school_reading_avg.mean()
school_reading_avg = school_reading_avg.rename(columns={"reading_score":"reading_avg"})
school_reading_avg

                       reading_avg
school_name
Bailey High School       81.033963
Cabrera High School      83.975780
Figueroa High School     81.158020
Ford High School         80.746258
Griffin High School      83.816757
Hernandez High School    80.934412
Holden High School       83.814988
Huang High School        81.182722
Johnson High School      80.966394
Pena High School         84.044699
Rodriguez High School    80.744686
Shelton High School      83.725724
Thomas High School       83.848930
Wilson High School       83.989488
Wright High School       83.955000

In [75]:
cnt_passing_math = all_school_data.loc[all_school_data["math_score"]>65]
cnt_passing_math = cnt_passing_math[["school_name","math_score"]]
cnt_passing_math = cnt_passing_math.groupby(["school_name"])
cnt_passing_math = cnt_passing_math.count()
cnt_passing_math

                       math_score
school_name
Bailey High School           3762
Cabrera High School          1858
Figueroa High School         2208
Ford High School             2087
Griffin High School          1468
Hernandez High School        3498
Holden High School            427
Huang High School            2196
Johnson High School          3589
Pena High School              962
Rodriguez High School        3021
Shelton High School          1761
Thomas High School           1635
Wilson High School           2283
Wright High School           1800

In [76]:
cnt_passing_reading = all_school_data.loc[all_school_data["reading_score"]>65]
cnt_passing_reading = cnt_passing_reading[["school_name","reading_score"]]
cnt_passing_reading = cnt_passing_reading.groupby(["school_name"])
cnt_passing_reading = cnt_passing_reading.count()
cnt_passing_reading

                       reading_score
school_name
Bailey High School              4573
Cabrera High School             1858
Figueroa High School            2710
Ford High School                2487
Griffin High School             1468
Hernandez High School           4239
Holden High School               427
Huang High School               2677
Johnson High School             4383
Pena High School                 962
Rodriguez High School           3660
Shelton High School             1761
Thomas High School              1635
Wilson High School              2283
Wright High School              1800

In [77]:
per_passing_math = pd.merge(total_students_per_school,cnt_passing_math,on="school_name")
per_passing_math["percent_passing_math"] = (per_passing_math["math_score"]/per_passing_math["student_count"])*100
per_passing_math

                       student_count  math_score  percent_passing_math
school_name
Bailey High School              4976        3762             75.602894
Cabrera High School             1858        1858            100.000000
Figueroa High School            2949        2208             74.872838
Ford High School                2739        2087             76.195692
Griffin High School             1468        1468            100.000000
Hernandez High School           4635        3498             75.469256
Holden High School               427         427            100.000000
Huang High School               2917        2196             75.282825
Johnson High School             4761        3589             75.383323
Pena High School                 962         962            100.000000
Rodriguez High School           3999        3021             75.543886
Shelton High School             1761        1761            100.000000
Thomas High School              1635        1635            100.000000
Wilson High School              2283        2283            100.000000
Wright High School              1800        1800            100.000000

In [78]:
per_passing_reading = pd.merge(total_students_per_school,cnt_passing_reading,on="school_name")
per_passing_reading["percent_passing_reading"] = (per_passing_reading["reading_score"]/per_passing_reading["student_count"])*100
per_passing_reading

                       student_count  reading_score  percent_passing_reading
school_name
Bailey High School              4976           4573                91.901125
Cabrera High School             1858           1858               100.000000
Figueroa High School            2949           2710                91.895558
Ford High School                2739           2487                90.799562
Griffin High School             1468           1468               100.000000
Hernandez High School           4635           4239                91.456311
Holden High School               427            427               100.000000
Huang High School               2917           2677                91.772369
Johnson High School             4761           4383                92.060491
Pena High School                 962            962               100.000000
Rodriguez High School           3999           3660                91.522881
Shelton High School             1761           1761               100.000000
Thomas High School              1635           1635               100.000000
Wilson High School              2283           2283               100.000000
Wright High School              1800           1800               100.000000

In [79]:
overall_rate = pd.merge(per_passing_math,per_passing_reading,on="school_name")
overall_rate["overall_pass_rate"]=(overall_rate["percent_passing_math"]+overall_rate["percent_passing_reading"])/2
del overall_rate["student_count_x"]
del overall_rate["math_score"]
del overall_rate["percent_passing_math"]
del overall_rate["student_count_y"]
del overall_rate["reading_score"]
del overall_rate["percent_passing_reading"]
overall_rate

                       overall_pass_rate
school_name
Bailey High School             83.752010
Cabrera High School           100.000000
Figueroa High School           83.384198
Ford High School               83.497627
Griffin High School           100.000000
Hernandez High School          83.462783
Holden High School            100.000000
Huang High School              83.527597
Johnson High School            83.721907
Pena High School              100.000000
Rodriguez High School          83.533383
Shelton High School           100.000000
Thomas High School            100.000000
Wilson High School            100.000000
Wright High School            100.000000

In [80]:
school_summary = schools[["school_name", "type"]]
school_summary = pd.merge(school_summary,total_students_per_school,on="school_name")
school_summary = pd.merge(school_summary,school_budgt,on="school_name")
school_summary = pd.merge(school_summary,school_math_avg,on="school_name")
school_summary = pd.merge(school_summary,school_reading_avg,on="school_name")
school_summary = pd.merge(school_summary,per_passing_math,on="school_name")
school_summary = pd.merge(school_summary,per_passing_reading,on="school_name")
school_summary = pd.merge(school_summary,overall_rate,on="school_name")
del school_summary["student_count_x"]
del school_summary["math_score"]
del school_summary["student_count_y"]
del school_summary["reading_score"]
school_summary = school_summary.rename(columns={"school_name":"School Name",
                                          "type":"School Type",
                                          "student_count_x":"Total Students",
                                          "budget":"Total School Budget",
                                          "budgt_per_student":"Per Student Budget",
                                          "math_avg":"Average Math Score",
                                          "reading_avg":"Average Reading Score",
                                          "percent_passing_math":"% Passing Math",
                                          "percent_passing_reading":"% Passing Reading",
                                         "overall_pass_rate":"Overall Passing Rate"})
#school_summary["Total School Budget"]=district_summary["Total School Budget"].map("${:,}".format)

# School Summary

In [119]:
school_summary.head()

,School Name,School Type,Total School Budget,Per Student Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,Overall Passing Rate,Spending Bucket,School ID,school_name,type,size,budget
0,Huang High School,District,1910635,655.0,76.629414,81.182722,75.282825,91.772369,83.527597,$620+,0,Huang High School,District,2917,1910635
1,Figueroa High School,District,1884411,639.0,76.711767,81.158020,74.872838,91.895558,83.384198,$620+,1,Figueroa High School,District,2949,1884411
2,Shelton High School,Charter,1056600,600.0,83.359455,83.725724,100.000000,100.000000,100.000000,$590+,2,Shelton High School,Charter,1761,1056600
3,Hernandez High School,District,3022020,652.0,77.289752,80.934412,75.469256,91.456311,83.462783,$620+,3,Hernandez High School,District,4635,3022020
4,Griffin High School,Charter,917500,625.0,83.351499,83.816757,100.000000,100.000000,100.000000,$620+,4,Griffin High School,Charter,1468,917500

# Top Performing Schools (By Passing Rate)

In [82]:
top_schools = school_summary.sort_values(by=["Overall Passing Rate","Average Math Score","Average Reading Score"]\
                                         ,ascending=False)
top_schools.head()

,School Name,School Type,Total School Budget,Per Student Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,Overall Passing Rate
9,Pena High School,Charter,585858,609.0,83.839917,84.044699,100.0,100.0,100.0
8,Holden High School,Charter,248087,581.0,83.803279,83.814988,100.0,100.0,100.0
10,Wright High School,Charter,1049400,583.0,83.682222,83.955000,100.0,100.0,100.0
14,Thomas High School,Charter,1043130,638.0,83.418349,83.848930,100.0,100.0,100.0
2,Shelton High School,Charter,1056600,600.0,83.359455,83.725724,100.0,100.0,100.0

# Bottom Performing Schools (By Passing Rate)

In [83]:
bottom_schools = school_summary.sort_values(by=["Overall Passing Rate","Average Math Score","Average Reading Score"]\
                                         ,ascending=True)
bottom_schools.head()

,School Name,School Type,Total School Budget,Per Student Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,Overall Passing Rate
1,Figueroa High School,District,1884411,639.0,76.711767,81.158020,74.872838,91.895558,83.384198
3,Hernandez High School,District,3022020,652.0,77.289752,80.934412,75.469256,91.456311,83.462783
13,Ford High School,District,1763916,644.0,77.102592,80.746258,76.195692,90.799562,83.497627
0,Huang High School,District,1910635,655.0,76.629414,81.182722,75.282825,91.772369,83.527597
11,Rodriguez High School,District,2547363,637.0,76.842711,80.744686,75.543886,91.522881,83.533383

# Math Scores by Grade

In [84]:
math_scores_by_grade = all_school_data[["school_name","grade","math_score"]]
math_scores_by_grade = math_scores_by_grade.groupby(["school_name", "grade"])
math_scores_by_grade = math_scores_by_grade.mean()
math_scores_by_grade.head()

                           math_score
school_name         grade
Bailey High School  10th    76.996772
                    11th    77.515588
                    12th    76.492218
                    9th     77.083676
Cabrera High School 10th    83.154506

# Reading Scores by Grade

In [94]:
reading_scores_by_grade = all_school_data[["school_name","grade","reading_score"]]
reading_scores_by_grade = reading_scores_by_grade.groupby(["school_name", "grade"])
reading_scores_by_grade = reading_scores_by_grade.mean()
reading_scores_by_grade.head()

                           reading_score
school_name         grade
Bailey High School  10th       80.907183
                    11th       80.945643
                    12th       80.912451
                    9th        81.303155
Cabrera High School 10th       84.253219

# Scores by School Spending

In [118]:
bins = [575,590,605,620,1000]
buckets = ["$575+","$590+","$605+","$620+"]
school_summary["Spending Bucket"] = pd.cut(school_summary["Per Student Budget"],bins,labels=buckets)
scores_by_spending = school_summary[["School Name","Average Math Score","Average Reading Score","% Passing Math",\
                           "% Passing Reading","Overall Passing Rate","Spending Bucket"]]
scores_by_spending = scores_by_spending.groupby(["Spending Bucket"]).mean()

scores_by_spending

,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,Overall Passing Rate
Spending Bucket,,,,,
$575+,83.455399,83.933814,100.000000,100.000000,100.000000
$590+,83.359455,83.725724,100.000000,100.000000,100.000000
$605+,83.839917,84.044699,100.000000,100.000000,100.000000
$620+,78.385220,81.603571,80.927857,93.489811,87.208834

# Scores by School Size

In [117]:
scores_by_size = pd.merge(school_summary,schools,left_on="School Name", right_on="school_name")
scores_by_size = scores_by_size[["School Name","Average Math Score","Average Reading Score",\
                                 "% Passing Math","% Passing Reading","Overall Passing Rate","size_x"]]
scores_by_size = scores_by_size.rename(columns={"size_x":"Size"})
bins = [0,1000,2000,5000]
buckets = ["Small","Medium","Large"]
scores_by_size["Size Bucket"] = pd.cut(scores_by_size["Size"],bins,labels=buckets)
scores_by_size = scores_by_size.groupby(["Size Bucket"]).mean()
scores_by_size

,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,Overall Passing Rate,Size
Size Bucket,,,,,,
Small,83.821598,83.929843,100.000000,100.000000,100.000000,694.500
Medium,83.374684,83.864438,100.000000,100.000000,100.000000,1704.400
Large,77.746417,81.344493,78.543839,92.676037,85.609938,3657.375

# Scores by School Type

In [122]:
scores_by_district = school_summary.groupby(["School Type"]).mean()
scores_by_district = scores_by_district[["Average Math Score","Average Reading Score","% Passing Math",\
                                        "% Passing Reading","Overall Passing Rate"]]
scores_by_district

,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,Overall Passing Rate
School Type,,,,,
Charter,83.473852,83.896421,100.000000,100.000000,100.000000
District,76.956733,80.966636,75.478673,91.629757,83.554215